velioo_webserver_node/tests/ab_test_application_2.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8885

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      100
Time taken for tests:   97.614 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      20100000 bytes
HTML transferred:       13600000 bytes
Requests per second:    1024.45 [#/sec] (mean)
Time per request:       97.614 [ms] (mean)
Time per request:       0.976 [ms] (mean, across all concurrent requests)
Transfer rate:          201.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.7      1       6
Processing:    64   97   8.2     93     195
Waiting:       13   51  12.9     51     129
Total:         65   98   8.1     94     195

Percentage of the requests served within a certain time (ms)
  50%     94
  66%    101
  75%    103
  80%    103
  90%    105
  95%    108
  98%    118
  99%    129
 100%    195 (longest request)