velioo_webserver_node/tests/ab_test_application_4.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8885

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      100
Time taken for tests:   97.686 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      20100000 bytes
HTML transferred:       13600000 bytes
Requests per second:    1023.69 [#/sec] (mean)
Time per request:       97.686 [ms] (mean)
Time per request:       0.977 [ms] (mean, across all concurrent requests)
Transfer rate:          200.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      1       5
Processing:    28   97   6.2     94     180
Waiting:       17   47  11.5     47     119
Total:         29   98   6.2     95     180

Percentage of the requests served within a certain time (ms)
  50%     95
  66%    103
  75%    103
  80%    103
  90%    104
  95%    105
  98%    107
  99%    111
 100%    180 (longest request)