velioo_webserver_node/tests/ab_test_application_5.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8885

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      100
Time taken for tests:   95.723 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      20100000 bytes
HTML transferred:       13600000 bytes
Requests per second:    1044.68 [#/sec] (mean)
Time per request:       95.723 [ms] (mean)
Time per request:       0.957 [ms] (mean, across all concurrent requests)
Transfer rate:          205.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      1      10
Processing:    65   95   9.0     91     225
Waiting:       15   48  13.0     49     132
Total:         65   96   9.0     92     225

Percentage of the requests served within a certain time (ms)
  50%     92
  66%     94
  75%     99
  80%    101
  90%    103
  95%    110
  98%    123
  99%    134
 100%    225 (longest request)