velioo_webserver_node/tests/ab_test_application_8.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8885

Document Path:          /application/index_test.html
Document Length:        136 bytes

Concurrency Level:      100
Time taken for tests:   88.013 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      20100000 bytes
HTML transferred:       13600000 bytes
Requests per second:    1136.20 [#/sec] (mean)
Time per request:       88.013 [ms] (mean)
Time per request:       0.880 [ms] (mean, across all concurrent requests)
Transfer rate:          223.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.5      1       8
Processing:    47   87   6.6     85     184
Waiting:        9   37  11.4     37     116
Total:         48   88   6.6     85     184

Percentage of the requests served within a certain time (ms)
  50%     85
  66%     87
  75%     90
  80%     94
  90%     96
  95%     97
  98%    104
  99%    112
 100%    184 (longest request)